Network Working Group                                   Fatai Zhang, Ed. 
Internet Draft                                                    Huawei 
Category: Standards Track                                  Guoying Zhang 
                                                                    CATR 
                                                          Sergio Belotti 
                                                          Alcatel-Lucent 
                                                           D. Ceccarelli 
                                                                Ericsson 
                                                        Khuzema Pithewan 
                                                                Infinera 
Expires: February 11, 2012                               August 11, 2011 
                                    
                                    
      Generalized Multi-Protocol Label Switching (GMPLS) Signaling 
  Extensions for the evolving G.709 Optical Transport Networks Control 
                                    
                                    
               draft-zhang-ccamp-gmpls-evolving-g709-09.txt 


Status of this Memo 

   This Internet-Draft is submitted to IETF in full conformance with   
   the provisions of BCP 78 and BCP 79. 

   Internet-Drafts are working documents of the Internet Engineering   
   Task Force (IETF), its areas, and its working groups.  Note that   
   other groups may also distribute working documents as Internet-   
   Drafts. 

   Internet-Drafts are draft documents valid for a maximum of six months   
   and may be updated, replaced, or obsoleted by other documents at any   
   time.  It is inappropriate to use Internet-Drafts as reference   
   material or to cite them other than as "work in progress." 

   The list of current Internet-Drafts can be accessed at   
   http://www.ietf.org/ietf/1id-abstracts.txt. 

   The list of Internet-Draft Shadow Directories can be accessed at   
   http://www.ietf.org/shadow.html. 

   This Internet-Draft will expire on February 11, 2012. 

    

Abstract 
 
   Recent progress in ITU-T Recommendation G.709 standardization has 
   introduced new ODU containers (ODU0, ODU4, ODU2e and ODUflex) and 

 
 
Zhang                  Expires February 2012                   [Page 1] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


   enhanced Optical Transport Networking (OTN) flexibility. Several 
   recent documents have proposed ways to modify GMPLS signaling 
   protocols to support these new OTN features.  

   It is important that a single solution is developed for use in GMPLS 
   signaling and routing protocols. This solution must support ODUk 
   multiplexing capabilities, address all of the new features, be 
   acceptable to all equipment vendors, and be extensible considering 
   continued OTN evolution.  

   This document describes the extensions to the Generalized Multi-
   Protocol Label Switching (GMPLS) signaling to control the evolving 
   Optical Transport Networks (OTN) addressing ODUk multiplexing and new 
   features including ODU0, ODU4, ODU2e and ODUflex. 

    

Conventions used in this document 

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", 
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this 
   document are to be interpreted as described in [RFC2119]. 

    

Table of Contents 

   1. Introduction .................................................. 3 
   2. Terminology ................................................... 4 
   3. GMPLS Extensions for the Evolving G.709 - Overview ............ 4 
   4. Extensions for Traffic Parameters for the Evolving G.709 ...... 5 
      4.1. Usage of ODUflex(CBR) Traffic Parameter .................. 6 
      4.2. Example of ODUflex(CBR) Traffic Parameter ................ 7 
   5. Generalized Label ............................................. 8 
      5.1. New definition of ODU Generalized Label .................. 8 
      5.2. Examples ................................................ 11 
      5.3. Label Distribution Procedure ............................ 12 
         5.3.1. Notification on Label Error ........................ 13 
      5.4. Supporting Virtual Concatenation and Multiplication ..... 14 
      5.5. Control Plane Backward Compatibility Considerations ..... 14 
   6. Supporting Multiplexing Hierarchy ............................ 15 
      6.1. ODU FA-LSP Creation ..................................... 17 
   7. Security Considerations ...................................... 17 
   8. IANA Considerations .......................................... 17 
   9. References ................................................... 17 
      9.1. Normative References .................................... 17 
      9.2. Informative References .................................. 19 
 
 
Zhang                  Expires February 2012                   [Page 2] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


   10. Contributors ............................................... 19 
   11. Authors' Addresses ......................................... 20 
   12. Acknowledgment ............................................. 22 
 
1. Introduction 

   Generalized Multi-Protocol Label Switching (GMPLS) [RFC3945] extends 
   MPLS to include Layer-2 Switching (L2SC), Time-Division Multiplex 
   (e.g., SONET/SDH, PDH, and ODU), Wavelength (OCh, Lambdas) Switching, 
   and Spatial Switching (e.g., incoming port or fiber to outgoing port 
   or fiber). [RFC3471] presents a functional description of the 
   extensions to Multi-Protocol Label Switching (MPLS) signaling 
   required to support Generalized MPLS.  RSVP-TE-specific formats and 
   mechanisms and technology specific details are defined in [RFC3473]. 

   With the evolution and deployment of G.709 technology, it is 
   necessary that appropriate enhanced control technology support be 
   provided for G.709. [RFC4328] describes the control technology 
   details that are specific to foundation G.709 Optical Transport 
   Networks (OTN), as specified in the ITU-T Recommendation G.709 [G709-
   V1], for ODUk deployments without multiplexing. 

   In addition to increasing need to support ODUk multiplexing, the 
   evolution of OTN has introduced additional containers and new 
   flexibility. For example, ODU0, ODU2e, ODU4 containers and ODUflex 
   are developed in [G709-V3]. 

   In addition, the following issues require consideration: 

      -  Support for hitless adjustment of ODUflex, which is to be 
         specified in ITU-T G.hao. 

      -  Support for Tributary Port Number. The Tributary Port Number 
         has to be negotiated on each link for flexible assignment of 
         tributary ports to tributary slots in case of LO-ODU over HO-
         ODU (e.g., ODU2 into ODU3).  

   Therefore, it is clear that [RFC4328] has to be updated or superceded 
   in order to support ODUk multiplexing, as well as other ODU 
   enhancements introduced by evolution of OTN standards.  

   This document updates [RFC4328] extending the G.709 ODUk traffic 
   parameters and also presents a new OTN label format which is very 
   flexible and scalable. 



 
 
Zhang                  Expires February 2012                   [Page 3] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


2. Terminology 

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",   
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this   
   document are to be interpreted as described in [RFC2119]. 

3. GMPLS Extensions for the Evolving G.709 - Overview 

   New features for the evolving OTN, for example, new ODU0, ODU2e, ODU4 
   and ODUflex containers are specified in [G709-V3]. The corresponding 
   new signal types are summarized below: 

      -  Optical Channel Transport Unit (OTUk): 
         . OTU4 

      -  Optical Channel Data Unit (ODUk): 
         . ODU0 
         . ODU2e 
         . ODU4 
         . ODUflex 

   A new Tributary Slot (TS) granularity (i.e., 1.25 Gbps) is also 
   described in [G709-V3]. Thus, there are now two TS granularities for 
   the foundation OTN ODU1, ODU2 and ODU3 containers. The TS granularity 
   at 2.5 Gbps is used on legacy interfaces while the new 1.25 Gbps is  
   used on the new interfaces. 

   In addition to the support of ODUk mapping into OTUk (k = 1, 2, 3, 4), 
   the evolving OTN [G.709-V3] encompasses the multiplexing of ODUj (j = 
   0, 1, 2, 2e, 3, flex) into an ODUk (k > j), as described in Section 
   3.1.2 of [OTN-frwk]. 

   Virtual Concatenation (VCAT) of OPUk (OPUk-Xv, k = 1/2/3, X = 1...256) 
   is also supported by [OTN-V3]. Note that VCAT of OPU0 / OPU2e / OPU4 
   / OPUflex is not supported per [OTN-V3]. 

   [RFC4328] describes GMPLS signaling extensions to support the control 
   for G.709 Optical Transport Networks (OTN) [G709-V1]. However, 
   [RFC4328] needs to be updated because it does not provide the means 
   to signal all the new signal types and related mapping and 
   multiplexing functionalities. Moreover, it supports only the 
   deprecated auto-MSI mode which assumes that the Tributary Port Number 
   is automatically assigned in the transmit direction and not checked 
   in the receive direction. 

   This document extends the G.709 traffic parameters described in 
   [RFC4328] and presents a new flexible and scalable OTN label format. 
 
 
Zhang                  Expires February 2012                   [Page 4] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


   Additionally, procedures about Tributary Port Number assignment 
   through control plane are also provided in this document. 

4. Extensions for Traffic Parameters for the Evolving G.709 

   The traffic parameters for G.709 are defined as follows: 

      0                   1                   2                   3 
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     |  Signal Type  |   Tolerance   |              NMC              | 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     |              NVC              |        Multiplier (MT)        | 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     |                            Bit_Rate                           | 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

   The Signal Type needs to be extended in order to cover the new Signal 
   Type introduced by the evolving OTN. The new Signal Type values are 
   extended as follows: 

      Value    Type 
      -----    ---- 
      0        Not significant 
      1        ODU1 (i.e., 2.5 Gbps) 
      2        ODU2 (i.e., 10 Gbps) 
      3        ODU3 (i.e., 40 Gbps) 
      4        ODU4 (i.e., 100 Gbps) 
      5        Reserved (for future use) 
      6        OCh at 2.5 Gbps 
      7        OCh at 10 Gbps 
      8        OCh at 40 Gbps 
      9        OCh at 100 Gbps 
      10       ODU0 (i.e., 1.25 Gbps) 
      11       ODU2e (i.e., 10Gbps for FC1200 and GE LAN) 
      12~19    Reserved (for future use) 
      20       ODUflex(CBR) (i.e., 1.25*N Gbps) 
      21       ODUflex(GFP-F), resizable (i.e., 1.25*N Gbps) 
      22       ODUflex(GFP-F), non resizable (i.e., 1.25*N Gbps) 
      23~255   Reserved (for future use) 

   In case of ODUflex(CBR), the Bit_Rate and Tolerance fields MUST be 
   used together to represent the actual bandwidth of ODUflex, where: 

 
 
Zhang                  Expires February 2012                   [Page 5] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


   -  The Bit_Rate field indicates the nominal bit rate of ODUflex(CBR) 
      expressed in bytes per second, encoded as a 32-bit IEEE single-
      precision floating-point number (referring to [RFC4506] and 
      [IEEE]). 

   -  The Tolerance field indicates the bit rate tolerance (part per 
      million, ppm) of the ODUflex(CBR) encoded as an unsigned integer, 
      which is bounded in 0~100ppm. 

   For example, for an ODUflex(CBR) service with Bit_Rate = 2.5Gbps and 
   Tolerance = 100ppm, the actual bandwidth of the ODUflex is: 

                         2.5Gbps * (1 +/- 100ppm) 

   In case of other ODUk signal types, the Bit_Rate and Tolerance fields 
   are not necessary and MUST be set to 0. 

   The usage of the NMC, NVC and Multiplier (MT) fields are the same as 
   [RFC4328]. 

4.1. Usage of ODUflex(CBR) Traffic Parameter 

   In case of ODUflex(CBR), the information of Bit_Rate and Tolerance in 
   the ODUflex traffic parameter MUST be used to determine the total 
   number of tributary slots N in the HO ODUk link to be reserved. Here:  

         N = Ceiling of 

   ODUflex(CBR) nominal bit rate * (1 + ODUflex(CBR) bit rate tolerance) 
   --------------------------------------------------------------------- 
       ODTUk.ts nominal bit rate * (1 - HO OPUk bit rate tolerance) 

    
   Therefore, a node receiving a PATH message containing ODUflex(CBR) 
   traffic parameter can allocate precise number of tributary slots and 
   set up the cross-connection for the ODUflex service. 

   Table 1 below shows the actual bandwidth of the tributary slot of 
   ODUk (in Gbps), referring to [G709-V3]. 

                   Table 1 - Actual TS bandwidth of ODUk 

      ODUk       Minimum          Nominal          Maximum 
      ------------------------------------------------------- 
      ODU2    1.249 384 632    1.249 409 620    1.249 434 608 
      ODU3    1.254 678 635    1.254 703 729    1.254 728 823 
      ODU4    1.301 683 217    1.301 709 251    1.301 735 285 
 
 
Zhang                  Expires February 2012                   [Page 6] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


      Note that: 

      Minimum bandwidth of ODUTk.ts =  
         ODTUk.ts nominal bit rate * (1 - HO OPUk bit rate tolerance) 

    
      Maximum bandwidth of ODTUk.ts =  
         ODTUk.ts nominal bit rate * (1 + HO OPUk bit rate tolerance) 

      Where: HO OPUk bit rate tolerance = 20ppm 

   For different ODUk, the bandwidths of the tributary slot are 
   different, and so the total number of tributary slots to be reserved 
   for the ODUflex(CBR) may not be the same on different HO ODUk links. 
   This is why the traffic parameter should bring the actual bandwidth 
   information other than the NMC field. 

    

4.2. Example of ODUflex(CBR) Traffic Parameter 

   This section gives an example to illustrate the usage of ODUflex(CBR) 
   traffic parameter. 

   As shown in Figure 1, assume there is an ODUflex(CBR) service 
   requesting a bandwidth of (2.5Gbps, +/-100ppm) from node A to node C. 
   In other words, the ODUflex traffic parameter indicates that Signal 
   Type is 33 (ODUflex(CBR)), Bit_Rate is 2.5Gbps and Tolerance is 
   100ppm. 

     +-----+             +---------+             +-----+ 
     |     +-------------+ +-----+ +-------------+     | 
     |     +=============+\| ODU |/+=============+     | 
     |     +=============+/| flex+-+=============+     | 
     |     +-------------+ |     |\+=============+     | 
     |     +-------------+ +-----+ +-------------+     | 
     |     |             |         |             |     | 
     |     |   .......   |         |   .......   |     | 
     |  A  +-------------+    B    +-------------+  C  | 
     +-----+   HO ODU4   +---------+   HO ODU2   +-----+ 
    
       =========: TS occupied by ODUflex 
       ---------: free TS 

            Figure 1 - Example of ODUflex(CBR) Traffic Parameter 

    
 
 
Zhang                  Expires February 2012                   [Page 7] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


   -  On the HO ODU4 link between node A and B: 

      The maximum bandwidth of the ODUflex equals 2.5Gbps * (1 + 
      100ppm), and the minimum bandwidth of the tributary slot of ODU4 
      equals 1.301 683 217Gbps, so the total number of tributary slots 
      N1 to be reserved on this link is: 

      N1 = ceiling (2.5Gbps * (1 + 100ppm) / 1.301 683 217) = 2 

   -  On the HO ODU2 link between node B and C: 

      The maximum bandwidth of the ODUflex equals 2.5Gbps * (1 + 
      100ppm), and the minimum bandwidth of the tributary slot of ODU2 
      equals 1.249 384 632Gbps, so the total number of tributary slots 
      N2 to be reserved on this link is: 

      N2 = ceiling (2.5Gbps * (1 + 100ppm) / 1.249 384 632) = 3 

5. Generalized Label 

   [RFC3471] has defined the Generalized Label which extends the 
   traditional label by allowing the representation of not only labels 
   which are sent in-band with associated data packets, but also labels 
   which identify time-slots, wavelengths, or space division multiplexed 
   positions. The format of the corresponding RSVP-TE Generalized Label   
   object is defined in the Section 2.3 of [RFC3473]. 

   However, for different technologies, we usually need use specific 
   label rather than the Generalized Label. For example, the label 
   format described in [RFC4606] could be used for SDH/SONET, the label 
   format in [RFC4328] for G.709.   

    

5.1. New definition of ODU Generalized Label 

   In order to be compatible with new types of ODU signal and new types 
   of tributary slot, the following new ODU label format MUST be used: 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |         TPN           |   Reserved    |        Length         | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   ~             Bit Map         .........                         ~ 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
 
 
Zhang                  Expires February 2012                   [Page 8] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


   The ODU Generalized Label is used to indicate how the LO ODUj signal 
   is multiplexed into the HO ODUk link. Note that the LO OUDj signal 
   type is indicated by traffic parameters, while the type of HO ODUk 
   link can be figured out locally according to the identifier of the 
   selected interface carried in the IF_ID RSVP_HOP Object. 

   TPN (12 bits): indicates the Tributary Port Number (TPN) for the 
   assigned Tributary Slot(s).  

      -  In case of LO ODUj multiplexed into HO ODU1/ODU2/ODU3, only the 
         lower 6 bits of TPN field are significant and the other bits of 
         TPN MUST be set to 0. 

      -  In case of LO ODUj multiplexed into HO ODU4, only the lower 7 
         bits of TPN field are significant and the other bits of TPN 
         MUST be set to 0.  

      -  In case of ODUj mapped into OTUk (j=k), the TPN is not needed 
         and this field MUST be set to 0. 

   As per [G709-V3], The TPN is used to allow for correct demultiplexing 
   in the data plane. When an LO ODUj is multiplexed into HO ODUk 
   occupying one or more TSs, a new TPN value is configured at the two 
   ends of the HO ODUk link and is put into the related MSI byte(s) in 
   the OPUk overhead at the (traffic) ingress end of the link, so that 
   the other end of the link can learn which TS(s) is/are used by the LO 
   ODUj in the data plane. 

   According to [G709-V3], the TPN field MUST be set as according to the 
   following tables: 

                                      
                                      
          Table 2 - TPN Assignment Rules (2.5Gbps TS granularity) 
   +-------+-------+----+----------------------------------------------+ 
   |HO ODUk|LO ODUj|TPN |          TPN Assignment Rules                | 
   +-------+-------+----+----------------------------------------------+ 
   | ODU2  | ODU1  |1~4 |Fixed, = TS# occupied by ODU1                 | 
   +-------+-------+----+----------------------------------------------+ 
   |       | ODU1  |1~16|Fixed, = TS# occupied by ODU1                 | 
   | ODU3  +-------+----+----------------------------------------------+ 
   |       | ODU2  |1~4 |Flexible, != other existing LO ODU2s' TPNs    | 
   +-------+-------+----+----------------------------------------------+ 

                                      
                                      
                                      
 
 
Zhang                  Expires February 2012                   [Page 9] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


          Table 3 - TPN Assignment Rules (1.25Gbps TS granularity) 
   +-------+-------+----+----------------------------------------------+ 
   |HO ODUk|LO ODUj|TPN |          TPN Assignment Rules                | 
   +-------+-------+----+----------------------------------------------+ 
   | ODU1  | ODU0  |1~2 |Fixed, = TS# occupied by ODU0                 | 
   +-------+-------+----+----------------------------------------------+ 
   |       | ODU1  |1~4 |Flexible, != other existing LO ODU1s' TPNs    | 
   | ODU2  +-------+----+----------------------------------------------+ 
   |       |ODU0 & |1~8 |Flexible, != other existing LO ODU0s and      | 
   |       |ODUflex|    |ODUflexes' TPNs                               | 
   +-------+-------+----+----------------------------------------------+ 
   |       | ODU1  |1~16|Flexible, != other existing LO ODU1s' TPNs    | 
   |       +-------+----+----------------------------------------------+ 
   |       | ODU2  |1~4 |Flexible, != other existing LO ODU2s' TPNs    | 
   | ODU3  +-------+----+----------------------------------------------+ 
   |       |ODU0 & |    |Flexible, != other existing LO ODU0s and      | 
   |       |ODU2e &|1~32|ODU2es and ODUflexes' TPNs                    | 
   |       |ODUflex|    |                                              | 
   +-------+-------+----+----------------------------------------------+ 
   | ODU4  |Any ODU|1~80|Flexible, != ANY other existing LO ODUs' TPNs | 
   +-------+-------+----+----------------------------------------------+ 

   Note that in the case of "Flexible", the value of TPN is not 
   corresponding to the TS number as per [G709-V3].  

   Length (12 bits): indicates the number of bit of the Bit Map field, 
   i.e., the total number of TS in the HO ODUk link.  

   In case of an ODUk mapped into OTUk, there is no need to indicate 
   which tributary slots will be used, so the length field MUST be set 
   to 0. 

   Bit Map (variable): indicates which tributary slots in HO ODUk that 
   the LO ODUj will be multiplexed into. The sequence of the Bit Map is 
   consistent with the sequence of the tributary slots in HO ODUk. Each 
   bit in the bit map represents the corresponding tributary slot in HO 
   ODUk with a value of 1 or 0 indicating whether the tributary slot 
   will be used by LO ODUj or not. 

   Padded bits are added behind the Bit Map to make the whole label a 
   multiple of four bytes if necessary. Padded bit MUST be set to 0 and 
   MUST be ignored. 

   Note that the Length field in the label format can also be used to 
   indicate the TS type of the HO ODUk (i.e., TS granularity at 1.25Gbps 
   or 2.5Gbps) since the HO ODUk type can be known from IF_ID RSVP_HOP 
   Object. In some cases when there is no LMP or routing to make the two 
 
 
Zhang                  Expires February 2012                  [Page 10] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


   end points of the link to know the TSG, the TSG information used by 
   another end can be deduced from the label format. For example, for HO 
   ODU2 link, the value of the length filed will be 4 or 8, which 
   indicates the TS granularity is 2.5Gbps or 1.25Gbps, respectively. 

5.2. Examples  

   The following examples are given in order to illustrate the label 
   format described in the previous sections of this document. 

   (1) ODUk into OTUk mapping:  

   In such conditions, the downstream node along an LSP returns a label 
   indicating that the ODUk (k=1, 2, 3, 4) is directly mapped into the 
   corresponding OTUk. The following example label indicates an ODU1 
   mapped into OTU1. 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |       TPN = 0         |   Reserved    |     Length = 0        | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

   (2) ODUj into ODUk multiplexing:  

   In such conditions, this label indicates that an ODUj is multiplexed 
   into several tributary slots of OPUk and then mapped into OTUk. Some 
   instances are shown as follow: 

   -  ODU0 into ODU2 Multiplexing: 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |       TPN = 2         |   Reserved    |     Length = 8        | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |0 1 0 0 0 0 0 0|             Padded Bits (0)                   | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

   This above label indicates an ODU0 multiplexed into the second 
   tributary slot of ODU2, wherein there are 8 TS in ODU2 (i.e., the 
   type of the tributary slot is 1.25Gbps), and the TPN value is 2. 

   -  ODU1 into ODU2 Multiplexing with 1.25Gbps TS granularity: 



 
 
Zhang                  Expires February 2012                  [Page 11] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |       TPN = 1         |   Reserved    |     Length = 8        | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |0 1 0 1 0 0 0 0|             Padded Bits (0)                   | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

   This above label indicates an ODU1 multiplexed into the 2nd and the 
   4th tributary slot of ODU2, wherein there are 8 TS in ODU2 (i.e., the 
   type of the tributary slot is 1.25Gbps), and the TPN value is 1. 

   -  ODU2 into ODU3 Multiplexing with 2.5Gbps TS granularity: 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |       TPN = 1         |   Reserved    |     Length = 16       | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |0 1 1 0 1 0 1 0 0 0 0 0 0 0 0 0|       Padded Bits (0)         | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

   This above label indicates an ODU2 multiplexed into the 2nd, 3rd, 5th 
   and 7th tributary slot of ODU3, wherein there are 16 TS in ODU3 (i.e., 
   the type of the tributary slot is 2.5Gbps), and the TPN value is 1. 

5.3. Label Distribution Procedure 

   This document does not change the existing label distribution 
   procedures [RFC4328] for GMPLS except that the new ODUk label MUST be 
   processed as follows. 

   When a node receives a generalized label request for setting up an 
   ODUj LSP from its upstream neighbor node, the node MUST generate an 
   ODU label according to the signal type of the requested LSP and the 
   free resources (i.e., free tributary slots of ODUk) that will be 
   reserved for the LSP, and send the label to its upstream neighbor 
   node.  

   In case of ODUj to ODUk multiplexing, the node MUST firstly determine 
   the size of the Bit Map field according to the signal type and the 
   tributary slot type of ODUk, and then set the bits to 1 in the Bit 
   Map field corresponding to the reserved tributary slots. The node 
   MUST also assign a valid TPN, which does not collide with other TPN 
   value used by existing LO ODU connections in the selected HO ODU link, 
   and configure the expected multiplex structure identifier (ExMSI) 
   using this TPN. Then, the assigned TPN is filled into the label. 
 
 
Zhang                  Expires February 2012                  [Page 12] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


   In case of ODUk to OTUk mapping, the node only needs to fill the ODUj 
   and the ODUk fields with corresponding values in the label. Other 
   bits are reserved and MUST be set to 0. 

   In order to process a received ODU label, the node MUST firstly learn 
   which ODU signal type is multiplexed or mapped into which ODU signal 
   type accordingly to the traffic parameters and the IF_ID RSVP_HOP 
   Object in the received message.  

   In case of ODUj to ODUk multiplexing, the node MUST retrieve the 
   reserved tributary slots in the ODUk by its downstream neighbor node 
   according to the position of the bits that are set to 1 in the Bit 
   Map field. The node determines the TS type (according to the total TS 
   number of the ODUk, or pre-configured TS type), so that the node, 
   based on the TS type, can multiplex the ODUj into the ODUk. The node 
   MUST also retrieve the TPN value assigned by its downstream neighbor 
   node from the label, and fill the TPN into the related MSI byte(s) in 
   the OPUk overhead in the data plane, so that the downstream neighbor 
   node can check whether the TPN received from the data plane is 
   consistent with the ExMSI and determine whether there is any mismatch 
   defect. 

   In case of ODUk to OTUk mapping, the size of Bit Map field MUST be 0 
   and no additional procedure is needed. 

   Note that the procedures of other label related objects (e.g., 
   Upstream Label, Label Set) are similar to the one described above. 

   Note also that the TPN in the label_ERO MAY not be assigned (i.e., 
   TPN field = 0) if the TPN is requested to be assigned locally.  

5.3.1. Notification on Label Error 

   When receiving an ODUk label from the neighbor node, the node SHOULD 
   check the integrity of the label. An error message containing an 
   "Unacceptable label value" indication ([RFC3209]) SHOULD be sent if 
   one of the following cases occurs: 

   -  Invalid value in the length field. 

   -  The selected link only supports 2.5Gbps TS granularity while the 
      Length field in the label along with ODUk signal type indicates 
      the 1.25Gbps TS granularity; 

   -  The label includes an invalid TPN value that breaks the TPN 
      assignment rules; 

 
 
Zhang                  Expires February 2012                  [Page 13] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


   -  The reserved resources (i.e., the number of "1" in the Bit Map 
      field) do not match with the Traffic Parameters. 

5.4. Supporting Virtual Concatenation and Multiplication 

   As per [VCAT], the VCGs can be created using Co-Signaled style or 
   Multiple LSPs style. 

   In case of Co-Signaled style, the explicit ordered list of all labels 
   reflects the order of VCG members, which is similar to [RFC4328]. In 
   case of multiplexed virtually concatenated signals (NVC > 1), the 
   first label indicates the components of the first virtually 
   concatenated signal; the second label indicates the components of the 
   second virtually concatenated signal; and so on. In case of 
   multiplication of multiplexed virtually concatenated signals (MT > 1), 
   the first label indicates the components of the first multiplexed 
   virtually concatenated signal; the second label indicates components 
   of the second multiplexed virtually concatenated signal; and so on. 

   In case of Multiple LSPs style, multiple control plane LSPs are 
   created with a single VCG and the VCAT Call can be used to associate 
   the control plane LSPs. The procedures are similar to section 6 of 
   [VCAT]. 

    

5.5. Control Plane Backward Compatibility Considerations 

   Since the [RFC4328] has been deployed in the network for the nodes 
   that support [G709-V1], we call nodes supporting [RFC4328] "legacy 
   nodes". Backward compatibility SHOULD be taken into consideration 
   when the new nodes (i.e., nodes that support RSVP-TE extensions 
   defined in this document) and the legacy nodes are interworking. 

   For backward compatibility consideration, the new node SHOULD have 
   the ability to generate and parse legacy labels. 

   o  A legacy node always generates and sends legacy label to its 
      upstream node, no matter the upstream node is new or legacy, as 
      described in [RFC4328]. 

   o  A new node SHOULD generate and send legacy labels if its upstream 
      node is a legacy one, and generate and send new label if its 
      upstream node is a new one. 

   One backward compatibility example is shown in Figure 2: 

 
 
Zhang                  Expires February 2012                  [Page 14] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


           Path          Path           Path           Path 
   +-----+ ----> +-----+ ----> +------+ ----> +------+ ----> +-----+ 
   |     |       |     |       |      |       |      |       |     | 
   |  A  +-------+  B  +-------+   C  +-------+   D  +-------+  E  | 
   | new |       | new |       |legacy|       |legacy|       | new | 
   +-----+ <---- +-----+ <---- +------+ <---- +------+ <---- +-----+ 
            Resv          Resv           Resv           Resv 
        (new label)  (legacy label) (legacy label)  (legacy label) 

                Figure 2 - Backwards compatibility example 

   As described above, for backward compatibility considerations, it is 
   necessary for a new node to know whether the neighbor node is new or 
   legacy. 

   One optional method is manual configuration, but it is recommended to 
   use LMP to discover the capability of the neighbor node automatically, 
   as described in [OTN-LMP].  

   When performing the HO ODU link capability negotiation: 

   o  If the neighbor node only support the 2.5Gbps TS and only support 
      ODU1/ODU2/ODU3, the neighbor node SHOULD be treated as a legacy 
      node. 

   o  If the neighbor node can support the 1.25Gbps TS, or can support 
      other LO ODU types defined in [G709-V3]), the neighbor node SHOULD 
      be treated as new node. 

   o  If the neighbor node returns a LinkSummaryNack message including 
      an ERROR_CODE indicating nonsupport of HO ODU link capability 
      negotiation, the neighbor node SHOULD be treated as a legacy node. 

    

6. Supporting Multiplexing Hierarchy  

   As described in [OTN-FRWK], one ODUj connection can be nested into 
   another ODUk (j<k) connection, which forms the multiplexing hierarchy 
   in the ODU layer. This is useful if there are some intermediate nodes 
   in the network which only support ODUk but not ODUj switching. 

   For example, in Figure 3, assume that N3 is a legacy node which only 
   supports [G709-V1] and does not support ODU0 switching. If an ODU0 
   connection between N1 and N5 is required, then we can create an ODU2 
   connection between N2 and N4 (or ODU1 / ODU3 connection, depending on 
   policies and the capabilities of the two ends of the connection), and 
 
 
Zhang                  Expires February 2012                  [Page 15] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


   nest the ODU0 into the ODU2 connection. In this way, N3 only needs to 
   perform ODU2 switching and does not need to be aware of the ODU0 
   connection.  

      |                                                          | 
      |<------------------- ODU0 Connection -------------------->| 
      |              |                            |              | 
      |              |<---- ODU2 Connection ----->|              | 
      |              |                            |              | 
   +----+         +----+         +----+         +----+         +----+ 
   | N1 +---------+ N2 +=========+ N3 +=========+ N4 +---------+ N5 | 
   +----+         +----+         +----+         +----+         +----+ 
         ODU3 link      ODU3 link      ODU3 link      ODU3 link 

               Figure 3 - Example of multiplexing hierarchy 

   The control plane signaling should support the provisioning of 
   hierarchical multiplexing. Two methods are provided below (taking 
   Figure 3 as example): 

   -  Using the multi-layer network signaling described in [RFC4206], 
      [RFC6107] and [RFC6001] (including related modifications, if 
      needed). That is, when the signaling message for ODUO connection 
      arrives at N2, a new RSVP session between N2 and N4 is triggered 
      to create the ODU2 connection. This ODU2 connection is treated as 
      a Forwarding Adjacency (FA) after it is created. And then the 
      signaling procedure for the ODU0 connection can be continued using 
      the resource of the ODU2 FA. 

   -  The ODU2 FA-LSP is created in advance based on network planning, 
      which is treated as an FA. Then the ODU0 connection can be created 
      using the resource of the ODU2 FA. In this case, the ODU2 FA-LSP 
      and inner ODU0 connections are created separately. 

   For both methods, when creating an FA-LSP(e.g., ODU2 FA-LSP), the 
   penultimate hop needs to choose a correct outgoing interface for the 
   ODU2 connection, so that the destination node can support 
   multiplexing and de-multiplexing LO ODU signal(e.g., ODU0). In order 
   to choose a correct outgoing interface for the penultimate hop of the 
   FA-LSP, multiplexing capability (i.e., what client signal type that 
   can be adapted directly to this FA-LSP) should be carried in the 
   signaling to setup this FA-LSP. In addition, when Auto_Negotiation in 
   the data plane is not enabled, TS granularity may also be needed. 




 
 
Zhang                  Expires February 2012                  [Page 16] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


6.1. ODU FA-LSP Creation 

   The required hierarchies and TS type for both ends of an FA-LSP is 
   for further study. 

    

7. Security Considerations 

   This document introduces no new security considerations to the 
   existing GMPLS signaling protocols. Referring to [RFC3473], further 
   details of the specific security measures are provided. Additionally, 
   [GMPLS-SEC] provides an overview of security vulnerabilities and 
   protection mechanisms for the GMPLS control plane. 

    

8. IANA Considerations 

   -  G.709 SENDER_TSPEC and FLOWSPEC objects: 

       The traffic parameters, which are carried in the G.709 
       SENDER_TSPEC and FLOWSPEC objects, do not require any new object 
       class and type based on [RFC4328]: 

       o  G.709 SENDER_TSPEC Object: Class = 12, C-Type = 5 [RFC4328] 

       o  G.709 FLOWSPEC Object: Class = 9, C-Type = 5 [RFC4328] 

   -  Generalized Label Object: 

       The new defined ODU label (Section 5) is a kind of generalized 
       label. Therefore, the Class-Num and C-Type of the ODU label is 
       the same as that of generalized label described in [RFC3473], 
       i.e., Class-Num = 16, C-Type = 2. 

    

9. References 

9.1. Normative References 

   [RFC2119] Bradner, S., "Key words for use in RFCs to Indicate 
             Requirement Levels", BCP 14, RFC 2119, March 1997. 



 
 
Zhang                  Expires February 2012                  [Page 17] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


   [RFC4328] D. Papadimitriou, Ed. "Generalized Multi-Protocol Label 
             Switching (GMPLS) Signaling Extensions for G.709 Optical 
             Transport Networks Control", RFC 4328, Jan 2006. 

   [RFC3209] D. Awduche et al, "RSVP-TE: Extensions to RSVP for LSP 
             Tunnels", RFC3209, December 2001. 

   [RFC3471] Berger, L., Editor, "Generalized Multi-Protocol Label 
             Switching (GMPLS) Signaling Functional Description", RFC 
             3471, January 2003. 

   [RFC3473] L. Berger, Ed., "Generalized Multi-Protocol Label Switching 
             (GMPLS) Signaling Resource ReserVation Protocol-Traffic 
             Engineering (RSVP-TE) Extensions", RFC 3473, January 2003. 

   [RFC3945] Mannie, E., "Generalized Multi-Protocol Label Switching 
             (GMPLS) Architecture", RFC 3945, October 2004. 

   [VCAT]    G. Bernstein et al, "Operating Virtual Concatenation (VCAT) 
             and the Link Capacity Adjustment Scheme (LCAS) with 
             Generalized Multi-Protocol Label Switching (GMPLS)", draft-
             ietf-ccamp-gmpls-vcat-lcas-13.txt, May 4, 2011. 

   [RFC4206] K. Kompella, Y. Rekhter, Ed., " Label Switched Paths (LSP) 
             Hierarchy with Generalized Multi-Protocol Label Switching 
             (GMPLS) Traffic Engineering (TE)", RFC 4206, October 2005. 

   [RFC6107] K. Shiomoto, A. Farrel, "Procedures for Dynamically 
             Signaled Hierarchical Label Switched Paths", RFC6107, 
             February 2011. 

   [RFC6001] Dimitri Papadimitriou et al, "Generalized Multi-Protocol 
             Label Switching (GMPLS) Protocol Extensions for Multi-Layer 
             and Multi-Region Networks (MLN/MRN)", RFC6001, February 21, 
             2010. 

   [OTN-frwk] Fatai Zhang et al, "Framework for GMPLS and PCE Control of 
             G.709 Optical Transport Networks", draft-ietf-ccamp-gmpls-
             g709-framework-04.txt, March 11, 2011. 

   [OTN-info] S. Belotti et al, "Information model for G.709 Optical 
             Transport Networks (OTN)", draft-ietf-ccamp-otn-g709-info-
             model-00.txt, April 18, 2011. 

   [OTN-LMP] Fatai Zhang, Ed., "Link Management Protocol (LMP) 
             extensions for G.709 Optical Transport Networks", draft-
             zhang-ccamp-gmpls-g.709-lmp-discovery-04.txt, April 6, 2011. 
 
 
Zhang                  Expires February 2012                  [Page 18] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


   [G709-V3] ITU-T, "Interfaces for the Optical Transport Network (OTN) 
             ", G.709/Y.1331, December 2009. 

9.2. Informative References 

   [G709-V1] ITU-T, "Interface for the Optical Transport Network (OTN)," 
             G.709 Recommendation (and Amendment 1), February 2001 
             (November 2001). 

   [G709-V2] ITU-T, "Interface for the Optical Transport Network (OTN)," 
             G.709 Recommendation, March 2003. 

   [G798-V2] ITU-T, "Characteristics of optical transport network 
             hierarchy equipment functional blocks", G.798, December 
             2006. 

   [G798-V3] ITU-T, "Characteristics of optical transport network 
             hierarchy equipment functional blocks", G.798v3, consented 
             June 2010. 

   [RFC4506] M. Eisler, Ed., "XDR: External Data Representation 
             Standard", RFC 4506, May 2006. 

   [IEEE]    "IEEE Standard for Binary Floating-Point Arithmetic", 
             ANSI/IEEE Standard 754-1985, Institute of Electrical and 
             Electronics Engineers, August 1985. 

   [GMPLS-SEC] Fang, L., Ed., "Security Framework for MPLS and GMPLS 
             Networks", Work in Progress, October 2009. 

 
 
10. Contributors

   Jonathan Sadler, Tellabs
   Email: jonathan.sadler@tellabs.com


   Kam LAM, Alcatel-Lucent
   Email: kam.lam@alcatel-lucent.com


   Xiaobing Zi, Huawei Technologies
   Email: zixiaobing@huawei.com



Zhang                  Expires February 2012                  [Page 19] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 



   Francesco Fondelli, Ericsson
   Email: francesco.fondelli@ericsson.com

   Lyndon Ong, Ciena
   Email: lyong@ciena.com

   Biao Lu, infinera
   Email: blu@infinera.com



11. Authors' Addresses

   Fatai Zhang (editor)
   Huawei Technologies
   F3-5-B R&D Center, Huawei Base
   Bantian, Longgang District
   Shenzhen 518129 P.R.China
   Phone: +86-755-28972912
   Email: zhangfatai@huawei.com


   Guoying Zhang
   China Academy of Telecommunication Research of MII
   11 Yue Tan Nan Jie Beijing, P.R.China
   Phone: +86-10-68094272
   Email: zhangguoying@mail.ritt.com.cn


   Sergio Belotti
   Alcatel-Lucent
   Optics CTO
   Via Trento 30 20059 Vimercate (Milano) Italy
   +39 039 6863033
   Email: sergio.belotti@alcatel-lucent.it


   Daniele Ceccarelli
   Ericsson
   Via A. Negrone 1/A
   Genova - Sestri Ponente


Zhang                  Expires February 2012                  [Page 20] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


   Italy
   Email: daniele.ceccarelli@ericsson.com


   Khuzema Pithewan
   Infinera Corporation
   169, Java Drive
   Sunnyvale, CA-94089,  USA
   Email: kpithewan@infinera.com


   Yi Lin
   Huawei Technologies
   F3-5-B R&D Center, Huawei Base
   Bantian, Longgang District
   Shenzhen 518129 P.R.China
   Phone: +86-755-28972914
   Email: yi.lin@huawei.com


   Yunbin Xu
   China Academy of Telecommunication Research of MII
   11 Yue Tan Nan Jie Beijing, P.R.China
   Phone: +86-10-68094134
   Email: xuyunbin@mail.ritt.com.cn


   Pietro Grandi
   Alcatel-Lucent
   Optics CTO
   Via Trento 30 20059 Vimercate (Milano) Italy
   +39 039 6864930
   Email: pietro_vittorio.grandi@alcatel-lucent.it


   Diego Caviglia
   Ericsson
   Via A. Negrone 1/A
   Genova - Sestri Ponente
   Italy
   Email: diego.caviglia@ericsson.com


Zhang                  Expires February 2012                  [Page 21] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 




   Rajan Rao
   Infinera Corporation
   169, Java Drive
   Sunnyvale, CA-94089
   USA
   Email: rrao@infinera.com


   John E Drake
   Juniper
   Email: jdrake@juniper.net


   Igor Bryskin
   Adva Optical
   EMail: IBryskin@advaoptical.com


12. Acknowledgment 

   The authors would like to thank Lou Berger and Deborah Brungard for 
   their useful comments to the document. 

    

Intellectual Property 
 
   The IETF Trust takes no position regarding the validity or scope of   
   any Intellectual Property Rights or other rights that might be   
   claimed to pertain to the implementation or use of the technology   
   described in any IETF Document or the extent to which any license   
   under such rights might or might not be available; nor does it   
   represent that it has made any independent effort to identify any   
   such rights. 

   Copies of Intellectual Property disclosures made to the IETF   
   Secretariat and any assurances of licenses to be made available, or   
   the result of an attempt made to obtain a general license or   
   permission for the use of such proprietary rights by implementers or   
   users of this specification can be obtained from the IETF on-line IPR   
   repository at http://www.ietf.org/ipr 

 
 
Zhang                  Expires February 2012                  [Page 22] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


   The IETF invites any interested party to bring to its attention any   
   copyrights, patents or patent applications, or other proprietary   
   rights that may cover technology that may be required to implement   
   any standard or specification contained in an IETF Document. Please   
   address the information to the IETF at ietf-ipr@ietf.org. 

   The definitive version of an IETF Document is that published by, or   
   under the auspices of, the IETF. Versions of IETF Documents that are   
   published by third parties, including those that are translated into   
   other languages, should not be considered to be definitive versions   
   of IETF Documents. The definitive version of these Legal Provisions   
   is that published by, or under the auspices of, the IETF. Versions of   
   these Legal Provisions that are published by third parties, including   
   those that are translated into other languages, should not be   
   considered to be definitive versions of these Legal Provisions. 

   For the avoidance of doubt, each Contributor to the IETF Standards   
   Process licenses each Contribution that he or she makes as part of   
   the IETF Standards Process to the IETF Trust pursuant to the   
   provisions of RFC 5378. No language to the contrary, or terms,   
   conditions or rights that differ from or are inconsistent with the   
   rights and licenses granted under RFC 5378, shall have any effect and   
   shall be null and void, whether published or posted by such   
   Contributor, or included with or in such Contribution. 

 
Disclaimer of Validity 
 
   All IETF Documents and the information contained therein are provided   
   on an "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE   
   REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE   
   IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL   
   WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY   
   WARRANTY THAT THE USE OF THE INFORMATION THEREIN WILL NOT INFRINGE   
   ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS   
   FOR A PARTICULAR PURPOSE. 

 
Copyright Notice 
 
   Copyright (c) 2010 IETF Trust and the persons identified as the 
   document authors.  All rights reserved. 

   This document is subject to BCP 78 and the IETF Trust's Legal 
   Provisions Relating to IETF Documents 
   (http://trustee.ietf.org/license-info) in effect on the date of 
 
 
Zhang                  Expires February 2012                  [Page 23] 

draft-zhang-ccamp-gmpls-evolving-g709-09.txt                August 2011 


   publication of this document.  Please review these documents 
   carefully, as they describe your rights and restrictions with respect 
   to this document.  Code Components extracted from this document must 
   include Simplified BSD License text as described in Section 4.e of 
   the Trust Legal Provisions and are provided without warranty as 
   described in the Simplified BSD License. 








































 
 
Zhang                  Expires February 2012                  [Page 24] 

